---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures.NoKeynoteAssignedToLinkedElement
source: html/4c844266-55c2-ac22-aa0e-3dfa02bfb865.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures.NoKeynoteAssignedToLinkedElement Property

The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoKeynoteAssignedToLinkedElement { get; }
```